MikroElektronika/core_packages/PIC/XC8/def/PIC18F2585/mcu.h
// Register: RXF7SIDH
#define RXF7SIDH RXF7SIDH
extern volatile unsigned char           RXF7SIDH            __at(0xD64);
#ifndef _LIB_BUILD
asm("RXF7SIDH equ 0D64h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXF7SID3               :1;
        unsigned RXF7SID4               :1;
        unsigned RXF7SID5               :1;
        unsigned RXF7SID6               :1;
        unsigned RXF7SID7               :1;
        unsigned RXF7SID8               :1;
        unsigned RXF7SID9               :1;
        unsigned RXF7SID10              :1;
    };
} RXF7SIDHbits_t;
extern volatile RXF7SIDHbits_t RXF7SIDHbits __at(0xD64);
// bitfield macros
#define _RXF7SIDH_SID3_POSN                                 0x0
#define _RXF7SIDH_SID3_POSITION                             0x0
#define _RXF7SIDH_SID3_SIZE                                 0x1
#define _RXF7SIDH_SID3_LENGTH                               0x1
#define _RXF7SIDH_SID3_MASK                                 0x1
#define _RXF7SIDH_SID4_POSN                                 0x1
#define _RXF7SIDH_SID4_POSITION                             0x1
#define _RXF7SIDH_SID4_SIZE                                 0x1
#define _RXF7SIDH_SID4_LENGTH                               0x1
#define _RXF7SIDH_SID4_MASK                                 0x2
#define _RXF7SIDH_SID5_POSN                                 0x2
#define _RXF7SIDH_SID5_POSITION                             0x2
#define _RXF7SIDH_SID5_SIZE                                 0x1
#define _RXF7SIDH_SID5_LENGTH                               0x1
#define _RXF7SIDH_SID5_MASK                                 0x4
#define _RXF7SIDH_SID6_POSN                                 0x3
#define _RXF7SIDH_SID6_POSITION                             0x3
#define _RXF7SIDH_SID6_SIZE                                 0x1
#define _RXF7SIDH_SID6_LENGTH                               0x1
#define _RXF7SIDH_SID6_MASK                                 0x8
#define _RXF7SIDH_SID7_POSN                                 0x4
#define _RXF7SIDH_SID7_POSITION                             0x4
#define _RXF7SIDH_SID7_SIZE                                 0x1
#define _RXF7SIDH_SID7_LENGTH                               0x1
#define _RXF7SIDH_SID7_MASK                                 0x10
#define _RXF7SIDH_SID8_POSN                                 0x5
#define _RXF7SIDH_SID8_POSITION                             0x5
#define _RXF7SIDH_SID8_SIZE                                 0x1
#define _RXF7SIDH_SID8_LENGTH                               0x1
#define _RXF7SIDH_SID8_MASK                                 0x20
#define _RXF7SIDH_SID9_POSN                                 0x6
#define _RXF7SIDH_SID9_POSITION                             0x6
#define _RXF7SIDH_SID9_SIZE                                 0x1
#define _RXF7SIDH_SID9_LENGTH                               0x1
#define _RXF7SIDH_SID9_MASK                                 0x40
#define _RXF7SIDH_SID10_POSN                                0x7
#define _RXF7SIDH_SID10_POSITION                            0x7
#define _RXF7SIDH_SID10_SIZE                                0x1
#define _RXF7SIDH_SID10_LENGTH                              0x1
#define _RXF7SIDH_SID10_MASK                                0x80
#define _RXF7SIDH_RXF7SID3_POSN                             0x0
#define _RXF7SIDH_RXF7SID3_POSITION                         0x0
#define _RXF7SIDH_RXF7SID3_SIZE                             0x1
#define _RXF7SIDH_RXF7SID3_LENGTH                           0x1
#define _RXF7SIDH_RXF7SID3_MASK                             0x1
#define _RXF7SIDH_RXF7SID4_POSN                             0x1
#define _RXF7SIDH_RXF7SID4_POSITION                         0x1
#define _RXF7SIDH_RXF7SID4_SIZE                             0x1
#define _RXF7SIDH_RXF7SID4_LENGTH                           0x1
#define _RXF7SIDH_RXF7SID4_MASK                             0x2
#define _RXF7SIDH_RXF7SID5_POSN                             0x2
#define _RXF7SIDH_RXF7SID5_POSITION                         0x2
#define _RXF7SIDH_RXF7SID5_SIZE                             0x1
#define _RXF7SIDH_RXF7SID5_LENGTH                           0x1
#define _RXF7SIDH_RXF7SID5_MASK                             0x4
#define _RXF7SIDH_RXF7SID6_POSN                             0x3
#define _RXF7SIDH_RXF7SID6_POSITION                         0x3
#define _RXF7SIDH_RXF7SID6_SIZE                             0x1
#define _RXF7SIDH_RXF7SID6_LENGTH                           0x1
#define _RXF7SIDH_RXF7SID6_MASK                             0x8
#define _RXF7SIDH_RXF7SID7_POSN                             0x4
#define _RXF7SIDH_RXF7SID7_POSITION                         0x4
#define _RXF7SIDH_RXF7SID7_SIZE                             0x1
#define _RXF7SIDH_RXF7SID7_LENGTH                           0x1
#define _RXF7SIDH_RXF7SID7_MASK                             0x10
#define _RXF7SIDH_RXF7SID8_POSN                             0x5
#define _RXF7SIDH_RXF7SID8_POSITION                         0x5
#define _RXF7SIDH_RXF7SID8_SIZE                             0x1
#define _RXF7SIDH_RXF7SID8_LENGTH                           0x1
#define _RXF7SIDH_RXF7SID8_MASK                             0x20
#define _RXF7SIDH_RXF7SID9_POSN                             0x6
#define _RXF7SIDH_RXF7SID9_POSITION                         0x6
#define _RXF7SIDH_RXF7SID9_SIZE                             0x1
#define _RXF7SIDH_RXF7SID9_LENGTH                           0x1
#define _RXF7SIDH_RXF7SID9_MASK                             0x40
#define _RXF7SIDH_RXF7SID10_POSN                            0x7
#define _RXF7SIDH_RXF7SID10_POSITION                        0x7
#define _RXF7SIDH_RXF7SID10_SIZE                            0x1
#define _RXF7SIDH_RXF7SID10_LENGTH                          0x1
#define _RXF7SIDH_RXF7SID10_MASK                            0x80

// Register: RXF7SIDL
#define RXF7SIDL RXF7SIDL
extern volatile unsigned char           RXF7SIDL            __at(0xD65);
#ifndef _LIB_BUILD
asm("RXF7SIDL equ 0D65h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :1;
        unsigned EXIDEN                 :1;
        unsigned                        :1;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned EXIDE                  :1;
    };
    struct {
        unsigned RXF7EID16              :1;
        unsigned RXF7EID17              :1;
        unsigned                        :1;
        unsigned RXF7EXIDEN             :1;
        unsigned                        :1;
        unsigned RXF7SID0               :1;
        unsigned RXF7SID1               :1;
        unsigned RXF7SID2               :1;
    };
} RXF7SIDLbits_t;
extern volatile RXF7SIDLbits_t RXF7SIDLbits __at(0xD65);
// bitfield macros
#define _RXF7SIDL_EID16_POSN                                0x0
#define _RXF7SIDL_EID16_POSITION                            0x0
#define _RXF7SIDL_EID16_SIZE                                0x1
#define _RXF7SIDL_EID16_LENGTH                              0x1
#define _RXF7SIDL_EID16_MASK                                0x1
#define _RXF7SIDL_EID17_POSN                                0x1
#define _RXF7SIDL_EID17_POSITION                            0x1
#define _RXF7SIDL_EID17_SIZE                                0x1
#define _RXF7SIDL_EID17_LENGTH                              0x1
#define _RXF7SIDL_EID17_MASK                                0x2
#define _RXF7SIDL_EXIDEN_POSN                               0x3
#define _RXF7SIDL_EXIDEN_POSITION                           0x3
#define _RXF7SIDL_EXIDEN_SIZE                               0x1
#define _RXF7SIDL_EXIDEN_LENGTH                             0x1
#define _RXF7SIDL_EXIDEN_MASK                               0x8
#define _RXF7SIDL_SID0_POSN                                 0x5
#define _RXF7SIDL_SID0_POSITION                             0x5
#define _RXF7SIDL_SID0_SIZE                                 0x1
#define _RXF7SIDL_SID0_LENGTH                               0x1
#define _RXF7SIDL_SID0_MASK                                 0x20
#define _RXF7SIDL_SID1_POSN                                 0x6
#define _RXF7SIDL_SID1_POSITION                             0x6
#define _RXF7SIDL_SID1_SIZE                                 0x1
#define _RXF7SIDL_SID1_LENGTH                               0x1
#define _RXF7SIDL_SID1_MASK                                 0x40
#define _RXF7SIDL_SID2_POSN                                 0x7
#define _RXF7SIDL_SID2_POSITION                             0x7
#define _RXF7SIDL_SID2_SIZE                                 0x1
#define _RXF7SIDL_SID2_LENGTH                               0x1
#define _RXF7SIDL_SID2_MASK                                 0x80
#define _RXF7SIDL_EXIDE_POSN                                0x3
#define _RXF7SIDL_EXIDE_POSITION                            0x3
#define _RXF7SIDL_EXIDE_SIZE                                0x1
#define _RXF7SIDL_EXIDE_LENGTH                              0x1
#define _RXF7SIDL_EXIDE_MASK                                0x8
#define _RXF7SIDL_RXF7EID16_POSN                            0x0
#define _RXF7SIDL_RXF7EID16_POSITION                        0x0
#define _RXF7SIDL_RXF7EID16_SIZE                            0x1
#define _RXF7SIDL_RXF7EID16_LENGTH                          0x1
#define _RXF7SIDL_RXF7EID16_MASK                            0x1
#define _RXF7SIDL_RXF7EID17_POSN                            0x1
#define _RXF7SIDL_RXF7EID17_POSITION                        0x1
#define _RXF7SIDL_RXF7EID17_SIZE                            0x1
#define _RXF7SIDL_RXF7EID17_LENGTH                          0x1
#define _RXF7SIDL_RXF7EID17_MASK                            0x2
#define _RXF7SIDL_RXF7EXIDEN_POSN                           0x3
#define _RXF7SIDL_RXF7EXIDEN_POSITION                       0x3
#define _RXF7SIDL_RXF7EXIDEN_SIZE                           0x1
#define _RXF7SIDL_RXF7EXIDEN_LENGTH                         0x1
#define _RXF7SIDL_RXF7EXIDEN_MASK                           0x8
#define _RXF7SIDL_RXF7SID0_POSN                             0x5
#define _RXF7SIDL_RXF7SID0_POSITION                         0x5
#define _RXF7SIDL_RXF7SID0_SIZE                             0x1
#define _RXF7SIDL_RXF7SID0_LENGTH                           0x1
#define _RXF7SIDL_RXF7SID0_MASK                             0x20
#define _RXF7SIDL_RXF7SID1_POSN                             0x6
#define _RXF7SIDL_RXF7SID1_POSITION                         0x6
#define _RXF7SIDL_RXF7SID1_SIZE                             0x1
#define _RXF7SIDL_RXF7SID1_LENGTH                           0x1
#define _RXF7SIDL_RXF7SID1_MASK                             0x40
#define _RXF7SIDL_RXF7SID2_POSN                             0x7
#define _RXF7SIDL_RXF7SID2_POSITION                         0x7
#define _RXF7SIDL_RXF7SID2_SIZE                             0x1
#define _RXF7SIDL_RXF7SID2_LENGTH                           0x1
#define _RXF7SIDL_RXF7SID2_MASK                             0x80

// Register: RXF7EIDH
#define RXF7EIDH RXF7EIDH
extern volatile unsigned char           RXF7EIDH            __at(0xD66);
#ifndef _LIB_BUILD
asm("RXF7EIDH equ 0D66h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXF7EID8               :1;
        unsigned RXF7EID9               :1;
        unsigned RXF7EID10              :1;
        unsigned RXF7EID11              :1;
        unsigned RXF7EID12              :1;
        unsigned RXF7EID13              :1;
        unsigned RXF7EID14              :1;
        unsigned RXF7EID15              :1;
    };
} RXF7EIDHbits_t;
extern volatile RXF7EIDHbits_t RXF7EIDHbits __at(0xD66);
// bitfield macros
#define _RXF7EIDH_EID8_POSN                                 0x0
#define _RXF7EIDH_EID8_POSITION                             0x0
#define _RXF7EIDH_EID8_SIZE                                 0x1
#define _RXF7EIDH_EID8_LENGTH                               0x1
#define _RXF7EIDH_EID8_MASK                                 0x1
#define _RXF7EIDH_EID9_POSN                                 0x1
#define _RXF7EIDH_EID9_POSITION                             0x1
#define _RXF7EIDH_EID9_SIZE                                 0x1
#define _RXF7EIDH_EID9_LENGTH                               0x1
#define _RXF7EIDH_EID9_MASK                                 0x2
#define _RXF7EIDH_EID10_POSN                                0x2
#define _RXF7EIDH_EID10_POSITION                            0x2
#define _RXF7EIDH_EID10_SIZE                                0x1
#define _RXF7EIDH_EID10_LENGTH                              0x1
#define _RXF7EIDH_EID10_MASK                                0x4
#define _RXF7EIDH_EID11_POSN                                0x3
#define _RXF7EIDH_EID11_POSITION                            0x3
#define _RXF7EIDH_EID11_SIZE                                0x1
#define _RXF7EIDH_EID11_LENGTH                              0x1
#define _RXF7EIDH_EID11_MASK                                0x8
#define _RXF7EIDH_EID12_POSN                                0x4
#define _RXF7EIDH_EID12_POSITION                            0x4
#define _RXF7EIDH_EID12_SIZE                                0x1
#define _RXF7EIDH_EID12_LENGTH                              0x1
#define _RXF7EIDH_EID12_MASK                                0x10
#define _RXF7EIDH_EID13_POSN                                0x5
#define _RXF7EIDH_EID13_POSITION                            0x5
#define _RXF7EIDH_EID13_SIZE                                0x1
#define _RXF7EIDH_EID13_LENGTH                              0x1
#define _RXF7EIDH_EID13_MASK                                0x20
#define _RXF7EIDH_EID14_POSN                                0x6
#define _RXF7EIDH_EID14_POSITION                            0x6
#define _RXF7EIDH_EID14_SIZE                                0x1
#define _RXF7EIDH_EID14_LENGTH                              0x1
#define _RXF7EIDH_EID14_MASK                                0x40
#define _RXF7EIDH_EID15_POSN                                0x7
#define _RXF7EIDH_EID15_POSITION                            0x7
#define _RXF7EIDH_EID15_SIZE                                0x1
#define _RXF7EIDH_EID15_LENGTH                              0x1
#define _RXF7EIDH_EID15_MASK                                0x80
#define _RXF7EIDH_RXF7EID8_POSN                             0x0
#define _RXF7EIDH_RXF7EID8_POSITION                         0x0
#define _RXF7EIDH_RXF7EID8_SIZE                             0x1
#define _RXF7EIDH_RXF7EID8_LENGTH                           0x1
#define _RXF7EIDH_RXF7EID8_MASK                             0x1
#define _RXF7EIDH_RXF7EID9_POSN                             0x1
#define _RXF7EIDH_RXF7EID9_POSITION                         0x1
#define _RXF7EIDH_RXF7EID9_SIZE                             0x1
#define _RXF7EIDH_RXF7EID9_LENGTH                           0x1
#define _RXF7EIDH_RXF7EID9_MASK                             0x2
#define _RXF7EIDH_RXF7EID10_POSN                            0x2
#define _RXF7EIDH_RXF7EID10_POSITION                        0x2
#define _RXF7EIDH_RXF7EID10_SIZE                            0x1
#define _RXF7EIDH_RXF7EID10_LENGTH                          0x1
#define _RXF7EIDH_RXF7EID10_MASK                            0x4
#define _RXF7EIDH_RXF7EID11_POSN                            0x3
#define _RXF7EIDH_RXF7EID11_POSITION                        0x3
#define _RXF7EIDH_RXF7EID11_SIZE                            0x1
#define _RXF7EIDH_RXF7EID11_LENGTH                          0x1
#define _RXF7EIDH_RXF7EID11_MASK                            0x8
#define _RXF7EIDH_RXF7EID12_POSN                            0x4
#define _RXF7EIDH_RXF7EID12_POSITION                        0x4
#define _RXF7EIDH_RXF7EID12_SIZE                            0x1
#define _RXF7EIDH_RXF7EID12_LENGTH                          0x1
#define _RXF7EIDH_RXF7EID12_MASK                            0x10
#define _RXF7EIDH_RXF7EID13_POSN                            0x5
#define _RXF7EIDH_RXF7EID13_POSITION                        0x5
#define _RXF7EIDH_RXF7EID13_SIZE                            0x1
#define _RXF7EIDH_RXF7EID13_LENGTH                          0x1
#define _RXF7EIDH_RXF7EID13_MASK                            0x20
#define _RXF7EIDH_RXF7EID14_POSN                            0x6
#define _RXF7EIDH_RXF7EID14_POSITION                        0x6
#define _RXF7EIDH_RXF7EID14_SIZE                            0x1
#define _RXF7EIDH_RXF7EID14_LENGTH                          0x1
#define _RXF7EIDH_RXF7EID14_MASK                            0x40
#define _RXF7EIDH_RXF7EID15_POSN                            0x7
#define _RXF7EIDH_RXF7EID15_POSITION                        0x7
#define _RXF7EIDH_RXF7EID15_SIZE                            0x1
#define _RXF7EIDH_RXF7EID15_LENGTH                          0x1
#define _RXF7EIDH_RXF7EID15_MASK                            0x80

// Register: RXF7EIDL
#define RXF7EIDL RXF7EIDL
extern volatile unsigned char           RXF7EIDL            __at(0xD67);
#ifndef _LIB_BUILD
asm("RXF7EIDL equ 0D67h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXF7EID0               :1;
        unsigned RXF7EID1               :1;
        unsigned RXF7EID2               :1;
        unsigned RXF7EID3               :1;
        unsigned RXF7EID4               :1;
        unsigned RXF7EID5               :1;
        unsigned RXF7EID6               :1;
        unsigned RXF7EID7               :1;
    };
} RXF7EIDLbits_t;
extern volatile RXF7EIDLbits_t RXF7EIDLbits __at(0xD67);
// bitfield macros
#define _RXF7EIDL_EID0_POSN                                 0x0
#define _RXF7EIDL_EID0_POSITION                             0x0
#define _RXF7EIDL_EID0_SIZE                                 0x1
#define _RXF7EIDL_EID0_LENGTH                               0x1
#define _RXF7EIDL_EID0_MASK                                 0x1
#define _RXF7EIDL_EID1_POSN                                 0x1
#define _RXF7EIDL_EID1_POSITION                             0x1
#define _RXF7EIDL_EID1_SIZE                                 0x1
#define _RXF7EIDL_EID1_LENGTH                               0x1
#define _RXF7EIDL_EID1_MASK                                 0x2
#define _RXF7EIDL_EID2_POSN                                 0x2
#define _RXF7EIDL_EID2_POSITION                             0x2
#define _RXF7EIDL_EID2_SIZE                                 0x1
#define _RXF7EIDL_EID2_LENGTH                               0x1
#define _RXF7EIDL_EID2_MASK                                 0x4
#define _RXF7EIDL_EID3_POSN                                 0x3
#define _RXF7EIDL_EID3_POSITION                             0x3
#define _RXF7EIDL_EID3_SIZE                                 0x1
#define _RXF7EIDL_EID3_LENGTH                               0x1
#define _RXF7EIDL_EID3_MASK                                 0x8
#define _RXF7EIDL_EID4_POSN                                 0x4
#define _RXF7EIDL_EID4_POSITION                             0x4
#define _RXF7EIDL_EID4_SIZE                                 0x1
#define _RXF7EIDL_EID4_LENGTH                               0x1
#define _RXF7EIDL_EID4_MASK                                 0x10
#define _RXF7EIDL_EID5_POSN                                 0x5
#define _RXF7EIDL_EID5_POSITION                             0x5
#define _RXF7EIDL_EID5_SIZE                                 0x1
#define _RXF7EIDL_EID5_LENGTH                               0x1
#define _RXF7EIDL_EID5_MASK                                 0x20
#define _RXF7EIDL_EID6_POSN                                 0x6
#define _RXF7EIDL_EID6_POSITION                             0x6
#define _RXF7EIDL_EID6_SIZE                                 0x1
#define _RXF7EIDL_EID6_LENGTH                               0x1
#define _RXF7EIDL_EID6_MASK                                 0x40
#define _RXF7EIDL_EID7_POSN                                 0x7
#define _RXF7EIDL_EID7_POSITION                             0x7
#define _RXF7EIDL_EID7_SIZE                                 0x1
#define _RXF7EIDL_EID7_LENGTH                               0x1
#define _RXF7EIDL_EID7_MASK                                 0x80
#define _RXF7EIDL_RXF7EID0_POSN                             0x0
#define _RXF7EIDL_RXF7EID0_POSITION                         0x0
#define _RXF7EIDL_RXF7EID0_SIZE                             0x1
#define _RXF7EIDL_RXF7EID0_LENGTH                           0x1
#define _RXF7EIDL_RXF7EID0_MASK                             0x1
#define _RXF7EIDL_RXF7EID1_POSN                             0x1
#define _RXF7EIDL_RXF7EID1_POSITION                         0x1
#define _RXF7EIDL_RXF7EID1_SIZE                             0x1
#define _RXF7EIDL_RXF7EID1_LENGTH                           0x1
#define _RXF7EIDL_RXF7EID1_MASK                             0x2
#define _RXF7EIDL_RXF7EID2_POSN                             0x2
#define _RXF7EIDL_RXF7EID2_POSITION                         0x2
#define _RXF7EIDL_RXF7EID2_SIZE                             0x1
#define _RXF7EIDL_RXF7EID2_LENGTH                           0x1
#define _RXF7EIDL_RXF7EID2_MASK                             0x4
#define _RXF7EIDL_RXF7EID3_POSN                             0x3
#define _RXF7EIDL_RXF7EID3_POSITION                         0x3
#define _RXF7EIDL_RXF7EID3_SIZE                             0x1
#define _RXF7EIDL_RXF7EID3_LENGTH                           0x1
#define _RXF7EIDL_RXF7EID3_MASK                             0x8
#define _RXF7EIDL_RXF7EID4_POSN                             0x4
#define _RXF7EIDL_RXF7EID4_POSITION                         0x4
#define _RXF7EIDL_RXF7EID4_SIZE                             0x1
#define _RXF7EIDL_RXF7EID4_LENGTH                           0x1
#define _RXF7EIDL_RXF7EID4_MASK                             0x10
#define _RXF7EIDL_RXF7EID5_POSN                             0x5
#define _RXF7EIDL_RXF7EID5_POSITION                         0x5
#define _RXF7EIDL_RXF7EID5_SIZE                             0x1
#define _RXF7EIDL_RXF7EID5_LENGTH                           0x1
#define _RXF7EIDL_RXF7EID5_MASK                             0x20
#define _RXF7EIDL_RXF7EID6_POSN                             0x6
#define _RXF7EIDL_RXF7EID6_POSITION                         0x6
#define _RXF7EIDL_RXF7EID6_SIZE                             0x1
#define _RXF7EIDL_RXF7EID6_LENGTH                           0x1
#define _RXF7EIDL_RXF7EID6_MASK                             0x40
#define _RXF7EIDL_RXF7EID7_POSN                             0x7
#define _RXF7EIDL_RXF7EID7_POSITION                         0x7
#define _RXF7EIDL_RXF7EID7_SIZE                             0x1
#define _RXF7EIDL_RXF7EID7_LENGTH                           0x1
#define _RXF7EIDL_RXF7EID7_MASK                             0x80

