MikroElektronika/core_packages/PIC/XC8/def/PIC18F2585/mcu.h
// Register: RXFCON1
#define RXFCON1 RXFCON1
extern volatile unsigned char           RXFCON1             __at(0xDD5);
#ifndef _LIB_BUILD
asm("RXFCON1 equ 0DD5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXF8EN                 :1;
        unsigned RXF9EN                 :1;
        unsigned RXF10EN                :1;
        unsigned RXF11EN                :1;
        unsigned RXF12EN                :1;
        unsigned RXF13EN                :1;
        unsigned RXF14EN                :1;
        unsigned RXF15EN                :1;
    };
} RXFCON1bits_t;
extern volatile RXFCON1bits_t RXFCON1bits __at(0xDD5);
// bitfield macros
#define _RXFCON1_RXF8EN_POSN                                0x0
#define _RXFCON1_RXF8EN_POSITION                            0x0
#define _RXFCON1_RXF8EN_SIZE                                0x1
#define _RXFCON1_RXF8EN_LENGTH                              0x1
#define _RXFCON1_RXF8EN_MASK                                0x1
#define _RXFCON1_RXF9EN_POSN                                0x1
#define _RXFCON1_RXF9EN_POSITION                            0x1
#define _RXFCON1_RXF9EN_SIZE                                0x1
#define _RXFCON1_RXF9EN_LENGTH                              0x1
#define _RXFCON1_RXF9EN_MASK                                0x2
#define _RXFCON1_RXF10EN_POSN                               0x2
#define _RXFCON1_RXF10EN_POSITION                           0x2
#define _RXFCON1_RXF10EN_SIZE                               0x1
#define _RXFCON1_RXF10EN_LENGTH                             0x1
#define _RXFCON1_RXF10EN_MASK                               0x4
#define _RXFCON1_RXF11EN_POSN                               0x3
#define _RXFCON1_RXF11EN_POSITION                           0x3
#define _RXFCON1_RXF11EN_SIZE                               0x1
#define _RXFCON1_RXF11EN_LENGTH                             0x1
#define _RXFCON1_RXF11EN_MASK                               0x8
#define _RXFCON1_RXF12EN_POSN                               0x4
#define _RXFCON1_RXF12EN_POSITION                           0x4
#define _RXFCON1_RXF12EN_SIZE                               0x1
#define _RXFCON1_RXF12EN_LENGTH                             0x1
#define _RXFCON1_RXF12EN_MASK                               0x10
#define _RXFCON1_RXF13EN_POSN                               0x5
#define _RXFCON1_RXF13EN_POSITION                           0x5
#define _RXFCON1_RXF13EN_SIZE                               0x1
#define _RXFCON1_RXF13EN_LENGTH                             0x1
#define _RXFCON1_RXF13EN_MASK                               0x20
#define _RXFCON1_RXF14EN_POSN                               0x6
#define _RXFCON1_RXF14EN_POSITION                           0x6
#define _RXFCON1_RXF14EN_SIZE                               0x1
#define _RXFCON1_RXF14EN_LENGTH                             0x1
#define _RXFCON1_RXF14EN_MASK                               0x40
#define _RXFCON1_RXF15EN_POSN                               0x7
#define _RXFCON1_RXF15EN_POSITION                           0x7
#define _RXFCON1_RXF15EN_SIZE                               0x1
#define _RXFCON1_RXF15EN_LENGTH                             0x1
#define _RXFCON1_RXF15EN_MASK                               0x80

// Register: SDFLC
#define SDFLC SDFLC
extern volatile unsigned char           SDFLC               __at(0xDD8);
#ifndef _LIB_BUILD
asm("SDFLC equ 0DD8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FLC0                   :1;
        unsigned FLC1                   :1;
        unsigned FLC2                   :1;
        unsigned FLC3                   :1;
        unsigned FLC4                   :1;
    };
    struct {
        unsigned DFLC0                  :1;
        unsigned DFLC1                  :1;
        unsigned DFLC2                  :1;
        unsigned DFLC3                  :1;
        unsigned DFLC4                  :1;
    };
} SDFLCbits_t;
extern volatile SDFLCbits_t SDFLCbits __at(0xDD8);
// bitfield macros
#define _SDFLC_FLC0_POSN                                    0x0
#define _SDFLC_FLC0_POSITION                                0x0
#define _SDFLC_FLC0_SIZE                                    0x1
#define _SDFLC_FLC0_LENGTH                                  0x1
#define _SDFLC_FLC0_MASK                                    0x1
#define _SDFLC_FLC1_POSN                                    0x1
#define _SDFLC_FLC1_POSITION                                0x1
#define _SDFLC_FLC1_SIZE                                    0x1
#define _SDFLC_FLC1_LENGTH                                  0x1
#define _SDFLC_FLC1_MASK                                    0x2
#define _SDFLC_FLC2_POSN                                    0x2
#define _SDFLC_FLC2_POSITION                                0x2
#define _SDFLC_FLC2_SIZE                                    0x1
#define _SDFLC_FLC2_LENGTH                                  0x1
#define _SDFLC_FLC2_MASK                                    0x4
#define _SDFLC_FLC3_POSN                                    0x3
#define _SDFLC_FLC3_POSITION                                0x3
#define _SDFLC_FLC3_SIZE                                    0x1
#define _SDFLC_FLC3_LENGTH                                  0x1
#define _SDFLC_FLC3_MASK                                    0x8
#define _SDFLC_FLC4_POSN                                    0x4
#define _SDFLC_FLC4_POSITION                                0x4
#define _SDFLC_FLC4_SIZE                                    0x1
#define _SDFLC_FLC4_LENGTH                                  0x1
#define _SDFLC_FLC4_MASK                                    0x10
#define _SDFLC_DFLC0_POSN                                   0x0
#define _SDFLC_DFLC0_POSITION                               0x0
#define _SDFLC_DFLC0_SIZE                                   0x1
#define _SDFLC_DFLC0_LENGTH                                 0x1
#define _SDFLC_DFLC0_MASK                                   0x1
#define _SDFLC_DFLC1_POSN                                   0x1
#define _SDFLC_DFLC1_POSITION                               0x1
#define _SDFLC_DFLC1_SIZE                                   0x1
#define _SDFLC_DFLC1_LENGTH                                 0x1
#define _SDFLC_DFLC1_MASK                                   0x2
#define _SDFLC_DFLC2_POSN                                   0x2
#define _SDFLC_DFLC2_POSITION                               0x2
#define _SDFLC_DFLC2_SIZE                                   0x1
#define _SDFLC_DFLC2_LENGTH                                 0x1
#define _SDFLC_DFLC2_MASK                                   0x4
#define _SDFLC_DFLC3_POSN                                   0x3
#define _SDFLC_DFLC3_POSITION                               0x3
#define _SDFLC_DFLC3_SIZE                                   0x1
#define _SDFLC_DFLC3_LENGTH                                 0x1
#define _SDFLC_DFLC3_MASK                                   0x8
#define _SDFLC_DFLC4_POSN                                   0x4
#define _SDFLC_DFLC4_POSITION                               0x4
#define _SDFLC_DFLC4_SIZE                                   0x1
#define _SDFLC_DFLC4_LENGTH                                 0x1
#define _SDFLC_DFLC4_MASK                                   0x10

// Register: RXFBCON0
#define RXFBCON0 RXFBCON0
extern volatile unsigned char           RXFBCON0            __at(0xDE0);
#ifndef _LIB_BUILD
asm("RXFBCON0 equ 0DE0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned F0BP_0                 :1;
        unsigned F0BP_1                 :1;
        unsigned F0BP_2                 :1;
        unsigned F0BP_3                 :1;
        unsigned F1BP_0                 :1;
        unsigned F1BP_1                 :1;
        unsigned F1BP_2                 :1;
        unsigned F1BP_3                 :1;
    };
    struct {
        unsigned F0BP_01                :1;
    };
} RXFBCON0bits_t;
extern volatile RXFBCON0bits_t RXFBCON0bits __at(0xDE0);
// bitfield macros
#define _RXFBCON0_F0BP_0_POSN                               0x0
#define _RXFBCON0_F0BP_0_POSITION                           0x0
#define _RXFBCON0_F0BP_0_SIZE                               0x1
#define _RXFBCON0_F0BP_0_LENGTH                             0x1
#define _RXFBCON0_F0BP_0_MASK                               0x1
#define _RXFBCON0_F0BP_1_POSN                               0x1
#define _RXFBCON0_F0BP_1_POSITION                           0x1
#define _RXFBCON0_F0BP_1_SIZE                               0x1
#define _RXFBCON0_F0BP_1_LENGTH                             0x1
#define _RXFBCON0_F0BP_1_MASK                               0x2
#define _RXFBCON0_F0BP_2_POSN                               0x2
#define _RXFBCON0_F0BP_2_POSITION                           0x2
#define _RXFBCON0_F0BP_2_SIZE                               0x1
#define _RXFBCON0_F0BP_2_LENGTH                             0x1
#define _RXFBCON0_F0BP_2_MASK                               0x4
#define _RXFBCON0_F0BP_3_POSN                               0x3
#define _RXFBCON0_F0BP_3_POSITION                           0x3
#define _RXFBCON0_F0BP_3_SIZE                               0x1
#define _RXFBCON0_F0BP_3_LENGTH                             0x1
#define _RXFBCON0_F0BP_3_MASK                               0x8
#define _RXFBCON0_F1BP_0_POSN                               0x4
#define _RXFBCON0_F1BP_0_POSITION                           0x4
#define _RXFBCON0_F1BP_0_SIZE                               0x1
#define _RXFBCON0_F1BP_0_LENGTH                             0x1
#define _RXFBCON0_F1BP_0_MASK                               0x10
#define _RXFBCON0_F1BP_1_POSN                               0x5
#define _RXFBCON0_F1BP_1_POSITION                           0x5
#define _RXFBCON0_F1BP_1_SIZE                               0x1
#define _RXFBCON0_F1BP_1_LENGTH                             0x1
#define _RXFBCON0_F1BP_1_MASK                               0x20
#define _RXFBCON0_F1BP_2_POSN                               0x6
#define _RXFBCON0_F1BP_2_POSITION                           0x6
#define _RXFBCON0_F1BP_2_SIZE                               0x1
#define _RXFBCON0_F1BP_2_LENGTH                             0x1
#define _RXFBCON0_F1BP_2_MASK                               0x40
#define _RXFBCON0_F1BP_3_POSN                               0x7
#define _RXFBCON0_F1BP_3_POSITION                           0x7
#define _RXFBCON0_F1BP_3_SIZE                               0x1
#define _RXFBCON0_F1BP_3_LENGTH                             0x1
#define _RXFBCON0_F1BP_3_MASK                               0x80
#define _RXFBCON0_F0BP_01_POSN                              0x0
#define _RXFBCON0_F0BP_01_POSITION                          0x0
#define _RXFBCON0_F0BP_01_SIZE                              0x1
#define _RXFBCON0_F0BP_01_LENGTH                            0x1
#define _RXFBCON0_F0BP_01_MASK                              0x1

