MikroElektronika/core_packages/PIC/XC8/def/PIC18F2585/mcu.h
// Register: B2D6
#define B2D6 B2D6
extern volatile unsigned char           B2D6                __at(0xE4C);
#ifndef _LIB_BUILD
asm("B2D6 equ 0E4Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B2D60                  :1;
        unsigned B2D61                  :1;
        unsigned B2D62                  :1;
        unsigned B2D63                  :1;
        unsigned B2D64                  :1;
        unsigned B2D65                  :1;
        unsigned B2D66                  :1;
        unsigned B2D67                  :1;
    };
} B2D6bits_t;
extern volatile B2D6bits_t B2D6bits __at(0xE4C);
// bitfield macros
#define _B2D6_B2D60_POSN                                    0x0
#define _B2D6_B2D60_POSITION                                0x0
#define _B2D6_B2D60_SIZE                                    0x1
#define _B2D6_B2D60_LENGTH                                  0x1
#define _B2D6_B2D60_MASK                                    0x1
#define _B2D6_B2D61_POSN                                    0x1
#define _B2D6_B2D61_POSITION                                0x1
#define _B2D6_B2D61_SIZE                                    0x1
#define _B2D6_B2D61_LENGTH                                  0x1
#define _B2D6_B2D61_MASK                                    0x2
#define _B2D6_B2D62_POSN                                    0x2
#define _B2D6_B2D62_POSITION                                0x2
#define _B2D6_B2D62_SIZE                                    0x1
#define _B2D6_B2D62_LENGTH                                  0x1
#define _B2D6_B2D62_MASK                                    0x4
#define _B2D6_B2D63_POSN                                    0x3
#define _B2D6_B2D63_POSITION                                0x3
#define _B2D6_B2D63_SIZE                                    0x1
#define _B2D6_B2D63_LENGTH                                  0x1
#define _B2D6_B2D63_MASK                                    0x8
#define _B2D6_B2D64_POSN                                    0x4
#define _B2D6_B2D64_POSITION                                0x4
#define _B2D6_B2D64_SIZE                                    0x1
#define _B2D6_B2D64_LENGTH                                  0x1
#define _B2D6_B2D64_MASK                                    0x10
#define _B2D6_B2D65_POSN                                    0x5
#define _B2D6_B2D65_POSITION                                0x5
#define _B2D6_B2D65_SIZE                                    0x1
#define _B2D6_B2D65_LENGTH                                  0x1
#define _B2D6_B2D65_MASK                                    0x20
#define _B2D6_B2D66_POSN                                    0x6
#define _B2D6_B2D66_POSITION                                0x6
#define _B2D6_B2D66_SIZE                                    0x1
#define _B2D6_B2D66_LENGTH                                  0x1
#define _B2D6_B2D66_MASK                                    0x40
#define _B2D6_B2D67_POSN                                    0x7
#define _B2D6_B2D67_POSITION                                0x7
#define _B2D6_B2D67_SIZE                                    0x1
#define _B2D6_B2D67_LENGTH                                  0x1
#define _B2D6_B2D67_MASK                                    0x80

// Register: B2D7
#define B2D7 B2D7
extern volatile unsigned char           B2D7                __at(0xE4D);
#ifndef _LIB_BUILD
asm("B2D7 equ 0E4Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B2D70                  :1;
        unsigned B2D71                  :1;
        unsigned B2D72                  :1;
        unsigned B2D73                  :1;
        unsigned B2D74                  :1;
        unsigned B2D75                  :1;
        unsigned B2D76                  :1;
        unsigned B2D77                  :1;
    };
} B2D7bits_t;
extern volatile B2D7bits_t B2D7bits __at(0xE4D);
// bitfield macros
#define _B2D7_B2D70_POSN                                    0x0
#define _B2D7_B2D70_POSITION                                0x0
#define _B2D7_B2D70_SIZE                                    0x1
#define _B2D7_B2D70_LENGTH                                  0x1
#define _B2D7_B2D70_MASK                                    0x1
#define _B2D7_B2D71_POSN                                    0x1
#define _B2D7_B2D71_POSITION                                0x1
#define _B2D7_B2D71_SIZE                                    0x1
#define _B2D7_B2D71_LENGTH                                  0x1
#define _B2D7_B2D71_MASK                                    0x2
#define _B2D7_B2D72_POSN                                    0x2
#define _B2D7_B2D72_POSITION                                0x2
#define _B2D7_B2D72_SIZE                                    0x1
#define _B2D7_B2D72_LENGTH                                  0x1
#define _B2D7_B2D72_MASK                                    0x4
#define _B2D7_B2D73_POSN                                    0x3
#define _B2D7_B2D73_POSITION                                0x3
#define _B2D7_B2D73_SIZE                                    0x1
#define _B2D7_B2D73_LENGTH                                  0x1
#define _B2D7_B2D73_MASK                                    0x8
#define _B2D7_B2D74_POSN                                    0x4
#define _B2D7_B2D74_POSITION                                0x4
#define _B2D7_B2D74_SIZE                                    0x1
#define _B2D7_B2D74_LENGTH                                  0x1
#define _B2D7_B2D74_MASK                                    0x10
#define _B2D7_B2D75_POSN                                    0x5
#define _B2D7_B2D75_POSITION                                0x5
#define _B2D7_B2D75_SIZE                                    0x1
#define _B2D7_B2D75_LENGTH                                  0x1
#define _B2D7_B2D75_MASK                                    0x20
#define _B2D7_B2D76_POSN                                    0x6
#define _B2D7_B2D76_POSITION                                0x6
#define _B2D7_B2D76_SIZE                                    0x1
#define _B2D7_B2D76_LENGTH                                  0x1
#define _B2D7_B2D76_MASK                                    0x40
#define _B2D7_B2D77_POSN                                    0x7
#define _B2D7_B2D77_POSITION                                0x7
#define _B2D7_B2D77_SIZE                                    0x1
#define _B2D7_B2D77_LENGTH                                  0x1
#define _B2D7_B2D77_MASK                                    0x80

// Register: CANSTAT_RO7
#define CANSTAT_RO7 CANSTAT_RO7
extern volatile unsigned char           CANSTAT_RO7         __at(0xE4E);
#ifndef _LIB_BUILD
asm("CANSTAT_RO7 equ 0E4Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EICODE0                :1;
        unsigned EICODE1_ICODE0         :1;
        unsigned EICODE2_ICODE1         :1;
        unsigned EICODE3_ICODE2         :1;
        unsigned EICODE4                :1;
        unsigned OPMODE0                :1;
        unsigned OPMODE1                :1;
        unsigned OPMODE2                :1;
    };
    struct {
        unsigned ICODE0                 :1;
        unsigned ICODE1                 :1;
        unsigned ICODE2                 :1;
        unsigned ICODE3                 :1;
        unsigned ICODE4                 :1;
    };
} CANSTAT_RO7bits_t;
extern volatile CANSTAT_RO7bits_t CANSTAT_RO7bits __at(0xE4E);
// bitfield macros
#define _CANSTAT_RO7_EICODE0_POSN                           0x0
#define _CANSTAT_RO7_EICODE0_POSITION                       0x0
#define _CANSTAT_RO7_EICODE0_SIZE                           0x1
#define _CANSTAT_RO7_EICODE0_LENGTH                         0x1
#define _CANSTAT_RO7_EICODE0_MASK                           0x1
#define _CANSTAT_RO7_EICODE1_ICODE0_POSN                    0x1
#define _CANSTAT_RO7_EICODE1_ICODE0_POSITION                0x1
#define _CANSTAT_RO7_EICODE1_ICODE0_SIZE                    0x1
#define _CANSTAT_RO7_EICODE1_ICODE0_LENGTH                  0x1
#define _CANSTAT_RO7_EICODE1_ICODE0_MASK                    0x2
#define _CANSTAT_RO7_EICODE2_ICODE1_POSN                    0x2
#define _CANSTAT_RO7_EICODE2_ICODE1_POSITION                0x2
#define _CANSTAT_RO7_EICODE2_ICODE1_SIZE                    0x1
#define _CANSTAT_RO7_EICODE2_ICODE1_LENGTH                  0x1
#define _CANSTAT_RO7_EICODE2_ICODE1_MASK                    0x4
#define _CANSTAT_RO7_EICODE3_ICODE2_POSN                    0x3
#define _CANSTAT_RO7_EICODE3_ICODE2_POSITION                0x3
#define _CANSTAT_RO7_EICODE3_ICODE2_SIZE                    0x1
#define _CANSTAT_RO7_EICODE3_ICODE2_LENGTH                  0x1
#define _CANSTAT_RO7_EICODE3_ICODE2_MASK                    0x8
#define _CANSTAT_RO7_EICODE4_POSN                           0x4
#define _CANSTAT_RO7_EICODE4_POSITION                       0x4
#define _CANSTAT_RO7_EICODE4_SIZE                           0x1
#define _CANSTAT_RO7_EICODE4_LENGTH                         0x1
#define _CANSTAT_RO7_EICODE4_MASK                           0x10
#define _CANSTAT_RO7_OPMODE0_POSN                           0x5
#define _CANSTAT_RO7_OPMODE0_POSITION                       0x5
#define _CANSTAT_RO7_OPMODE0_SIZE                           0x1
#define _CANSTAT_RO7_OPMODE0_LENGTH                         0x1
#define _CANSTAT_RO7_OPMODE0_MASK                           0x20
#define _CANSTAT_RO7_OPMODE1_POSN                           0x6
#define _CANSTAT_RO7_OPMODE1_POSITION                       0x6
#define _CANSTAT_RO7_OPMODE1_SIZE                           0x1
#define _CANSTAT_RO7_OPMODE1_LENGTH                         0x1
#define _CANSTAT_RO7_OPMODE1_MASK                           0x40
#define _CANSTAT_RO7_OPMODE2_POSN                           0x7
#define _CANSTAT_RO7_OPMODE2_POSITION                       0x7
#define _CANSTAT_RO7_OPMODE2_SIZE                           0x1
#define _CANSTAT_RO7_OPMODE2_LENGTH                         0x1
#define _CANSTAT_RO7_OPMODE2_MASK                           0x80
#define _CANSTAT_RO7_ICODE0_POSN                            0x0
#define _CANSTAT_RO7_ICODE0_POSITION                        0x0
#define _CANSTAT_RO7_ICODE0_SIZE                            0x1
#define _CANSTAT_RO7_ICODE0_LENGTH                          0x1
#define _CANSTAT_RO7_ICODE0_MASK                            0x1
#define _CANSTAT_RO7_ICODE1_POSN                            0x1
#define _CANSTAT_RO7_ICODE1_POSITION                        0x1
#define _CANSTAT_RO7_ICODE1_SIZE                            0x1
#define _CANSTAT_RO7_ICODE1_LENGTH                          0x1
#define _CANSTAT_RO7_ICODE1_MASK                            0x2
#define _CANSTAT_RO7_ICODE2_POSN                            0x2
#define _CANSTAT_RO7_ICODE2_POSITION                        0x2
#define _CANSTAT_RO7_ICODE2_SIZE                            0x1
#define _CANSTAT_RO7_ICODE2_LENGTH                          0x1
#define _CANSTAT_RO7_ICODE2_MASK                            0x4
#define _CANSTAT_RO7_ICODE3_POSN                            0x3
#define _CANSTAT_RO7_ICODE3_POSITION                        0x3
#define _CANSTAT_RO7_ICODE3_SIZE                            0x1
#define _CANSTAT_RO7_ICODE3_LENGTH                          0x1
#define _CANSTAT_RO7_ICODE3_MASK                            0x8
#define _CANSTAT_RO7_ICODE4_POSN                            0x4
#define _CANSTAT_RO7_ICODE4_POSITION                        0x4
#define _CANSTAT_RO7_ICODE4_SIZE                            0x1
#define _CANSTAT_RO7_ICODE4_LENGTH                          0x1
#define _CANSTAT_RO7_ICODE4_MASK                            0x10

// Register: CANCON_RO7
#define CANCON_RO7 CANCON_RO7
extern volatile unsigned char           CANCON_RO7          __at(0xE4F);
#ifndef _LIB_BUILD
asm("CANCON_RO7 equ 0E4Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FP0                    :1;
        unsigned WIN0_FP1               :1;
        unsigned WIN1_FP2               :1;
        unsigned WIN2_FP3               :1;
        unsigned ABAT                   :1;
        unsigned REQOP0                 :1;
        unsigned REQOP1                 :1;
        unsigned REQOP2                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned WIN0                   :1;
        unsigned WIN1                   :1;
        unsigned WIN2                   :1;
    };
} CANCON_RO7bits_t;
extern volatile CANCON_RO7bits_t CANCON_RO7bits __at(0xE4F);
// bitfield macros
#define _CANCON_RO7_FP0_POSN                                0x0
#define _CANCON_RO7_FP0_POSITION                            0x0
#define _CANCON_RO7_FP0_SIZE                                0x1
#define _CANCON_RO7_FP0_LENGTH                              0x1
#define _CANCON_RO7_FP0_MASK                                0x1
#define _CANCON_RO7_WIN0_FP1_POSN                           0x1
#define _CANCON_RO7_WIN0_FP1_POSITION                       0x1
#define _CANCON_RO7_WIN0_FP1_SIZE                           0x1
#define _CANCON_RO7_WIN0_FP1_LENGTH                         0x1
#define _CANCON_RO7_WIN0_FP1_MASK                           0x2
#define _CANCON_RO7_WIN1_FP2_POSN                           0x2
#define _CANCON_RO7_WIN1_FP2_POSITION                       0x2
#define _CANCON_RO7_WIN1_FP2_SIZE                           0x1
#define _CANCON_RO7_WIN1_FP2_LENGTH                         0x1
#define _CANCON_RO7_WIN1_FP2_MASK                           0x4
#define _CANCON_RO7_WIN2_FP3_POSN                           0x3
#define _CANCON_RO7_WIN2_FP3_POSITION                       0x3
#define _CANCON_RO7_WIN2_FP3_SIZE                           0x1
#define _CANCON_RO7_WIN2_FP3_LENGTH                         0x1
#define _CANCON_RO7_WIN2_FP3_MASK                           0x8
#define _CANCON_RO7_ABAT_POSN                               0x4
#define _CANCON_RO7_ABAT_POSITION                           0x4
#define _CANCON_RO7_ABAT_SIZE                               0x1
#define _CANCON_RO7_ABAT_LENGTH                             0x1
#define _CANCON_RO7_ABAT_MASK                               0x10
#define _CANCON_RO7_REQOP0_POSN                             0x5
#define _CANCON_RO7_REQOP0_POSITION                         0x5
#define _CANCON_RO7_REQOP0_SIZE                             0x1
#define _CANCON_RO7_REQOP0_LENGTH                           0x1
#define _CANCON_RO7_REQOP0_MASK                             0x20
#define _CANCON_RO7_REQOP1_POSN                             0x6
#define _CANCON_RO7_REQOP1_POSITION                         0x6
#define _CANCON_RO7_REQOP1_SIZE                             0x1
#define _CANCON_RO7_REQOP1_LENGTH                           0x1
#define _CANCON_RO7_REQOP1_MASK                             0x40
#define _CANCON_RO7_REQOP2_POSN                             0x7
#define _CANCON_RO7_REQOP2_POSITION                         0x7
#define _CANCON_RO7_REQOP2_SIZE                             0x1
#define _CANCON_RO7_REQOP2_LENGTH                           0x1
#define _CANCON_RO7_REQOP2_MASK                             0x80
#define _CANCON_RO7_WIN0_POSN                               0x1
#define _CANCON_RO7_WIN0_POSITION                           0x1
#define _CANCON_RO7_WIN0_SIZE                               0x1
#define _CANCON_RO7_WIN0_LENGTH                             0x1
#define _CANCON_RO7_WIN0_MASK                               0x2
#define _CANCON_RO7_WIN1_POSN                               0x2
#define _CANCON_RO7_WIN1_POSITION                           0x2
#define _CANCON_RO7_WIN1_SIZE                               0x1
#define _CANCON_RO7_WIN1_LENGTH                             0x1
#define _CANCON_RO7_WIN1_MASK                               0x4
#define _CANCON_RO7_WIN2_POSN                               0x3
#define _CANCON_RO7_WIN2_POSITION                           0x3
#define _CANCON_RO7_WIN2_SIZE                               0x1
#define _CANCON_RO7_WIN2_LENGTH                             0x1
#define _CANCON_RO7_WIN2_MASK                               0x8

// Register: B3CON
#define B3CON B3CON
extern volatile unsigned char           B3CON               __at(0xE50);
#ifndef _LIB_BUILD
asm("B3CON equ 0E50h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FILHIT0_TXPRI0         :1;
        unsigned FILHIT1_TXPRI1         :1;
        unsigned FILHIT2_RTREN          :1;
        unsigned FILHIT3_TXREQ          :1;
        unsigned FILHIT4_TXERR          :1;
        unsigned RXRTRRO_TXLARB         :1;
        unsigned RXM1_TXABT             :1;
        unsigned RXFUL_TXBIF            :1;
    };
    struct {
        unsigned FILHIT0                :1;
        unsigned FILHIT1                :1;
        unsigned FILHIT2                :1;
        unsigned FILHIT3                :1;
        unsigned FILHIT4                :1;
        unsigned RTRRO                  :1;
        unsigned RXM1                   :1;
        unsigned RXFUL                  :1;
    };
    struct {
        unsigned TXPRI0                 :1;
        unsigned TXPRI1                 :1;
        unsigned RTREN                  :1;
        unsigned TXREQ                  :1;
        unsigned TXERR                  :1;
        unsigned TXLARB                 :1;
        unsigned TXABT                  :1;
        unsigned TXBIF                  :1;
    };
    struct {
        unsigned                        :5;
        unsigned RXRTRRO                :1;
    };
    struct {
        unsigned B3FILHIT0              :1;
        unsigned B3FILHIT1              :1;
        unsigned B3FILHIT2              :1;
        unsigned B3FILHIT3              :1;
        unsigned B3FILHIT4              :1;
        unsigned B3RTRRO                :1;
        unsigned B3RXM1                 :1;
        unsigned B3RXFUL                :1;
    };
    struct {
        unsigned B3TXPRI0               :1;
        unsigned B3TXPRI1               :1;
        unsigned B3RTREN                :1;
        unsigned B3TXREQ                :1;
        unsigned B3TXERR                :1;
        unsigned B3TXLARB               :1;
        unsigned B3TXABT                :1;
        unsigned B3TXB3IF               :1;
    };
} B3CONbits_t;
