MikroElektronika/core_packages/PIC/XC8/def/PIC18F2585/mcu.h
// RXB0D3<RXB0D33>
extern volatile __bit                   RXB0D33             __at(0x7B4B);	// @ (0xF69 * 8 + 3)
#define                                 RXB0D33_bit         _BIT_ACCESS(RXB0D3,3)
// RXB0D3<RXB0D34>
extern volatile __bit                   RXB0D34             __at(0x7B4C);	// @ (0xF69 * 8 + 4)
#define                                 RXB0D34_bit         _BIT_ACCESS(RXB0D3,4)
// RXB0D3<RXB0D35>
extern volatile __bit                   RXB0D35             __at(0x7B4D);	// @ (0xF69 * 8 + 5)
#define                                 RXB0D35_bit         _BIT_ACCESS(RXB0D3,5)
// RXB0D3<RXB0D36>
extern volatile __bit                   RXB0D36             __at(0x7B4E);	// @ (0xF69 * 8 + 6)
#define                                 RXB0D36_bit         _BIT_ACCESS(RXB0D3,6)
// RXB0D3<RXB0D37>
extern volatile __bit                   RXB0D37             __at(0x7B4F);	// @ (0xF69 * 8 + 7)
#define                                 RXB0D37_bit         _BIT_ACCESS(RXB0D3,7)
// RXB0D4<RXB0D40>
extern volatile __bit                   RXB0D40             __at(0x7B50);	// @ (0xF6A * 8 + 0)
#define                                 RXB0D40_bit         _BIT_ACCESS(RXB0D4,0)
// RXB0D4<RXB0D41>
extern volatile __bit                   RXB0D41             __at(0x7B51);	// @ (0xF6A * 8 + 1)
#define                                 RXB0D41_bit         _BIT_ACCESS(RXB0D4,1)
// RXB0D4<RXB0D42>
extern volatile __bit                   RXB0D42             __at(0x7B52);	// @ (0xF6A * 8 + 2)
#define                                 RXB0D42_bit         _BIT_ACCESS(RXB0D4,2)
// RXB0D4<RXB0D43>
extern volatile __bit                   RXB0D43             __at(0x7B53);	// @ (0xF6A * 8 + 3)
#define                                 RXB0D43_bit         _BIT_ACCESS(RXB0D4,3)
// RXB0D4<RXB0D44>
extern volatile __bit                   RXB0D44             __at(0x7B54);	// @ (0xF6A * 8 + 4)
#define                                 RXB0D44_bit         _BIT_ACCESS(RXB0D4,4)
// RXB0D4<RXB0D45>
extern volatile __bit                   RXB0D45             __at(0x7B55);	// @ (0xF6A * 8 + 5)
#define                                 RXB0D45_bit         _BIT_ACCESS(RXB0D4,5)
// RXB0D4<RXB0D46>
extern volatile __bit                   RXB0D46             __at(0x7B56);	// @ (0xF6A * 8 + 6)
#define                                 RXB0D46_bit         _BIT_ACCESS(RXB0D4,6)
// RXB0D4<RXB0D47>
extern volatile __bit                   RXB0D47             __at(0x7B57);	// @ (0xF6A * 8 + 7)
#define                                 RXB0D47_bit         _BIT_ACCESS(RXB0D4,7)
// RXB0D5<RXB0D50>
extern volatile __bit                   RXB0D50             __at(0x7B58);	// @ (0xF6B * 8 + 0)
#define                                 RXB0D50_bit         _BIT_ACCESS(RXB0D5,0)
// RXB0D5<RXB0D51>
extern volatile __bit                   RXB0D51             __at(0x7B59);	// @ (0xF6B * 8 + 1)
#define                                 RXB0D51_bit         _BIT_ACCESS(RXB0D5,1)
// RXB0D5<RXB0D52>
extern volatile __bit                   RXB0D52             __at(0x7B5A);	// @ (0xF6B * 8 + 2)
#define                                 RXB0D52_bit         _BIT_ACCESS(RXB0D5,2)
// RXB0D5<RXB0D53>
extern volatile __bit                   RXB0D53             __at(0x7B5B);	// @ (0xF6B * 8 + 3)
#define                                 RXB0D53_bit         _BIT_ACCESS(RXB0D5,3)
// RXB0D5<RXB0D54>
extern volatile __bit                   RXB0D54             __at(0x7B5C);	// @ (0xF6B * 8 + 4)
#define                                 RXB0D54_bit         _BIT_ACCESS(RXB0D5,4)
// RXB0D5<RXB0D55>
extern volatile __bit                   RXB0D55             __at(0x7B5D);	// @ (0xF6B * 8 + 5)
#define                                 RXB0D55_bit         _BIT_ACCESS(RXB0D5,5)
// RXB0D5<RXB0D56>
extern volatile __bit                   RXB0D56             __at(0x7B5E);	// @ (0xF6B * 8 + 6)
#define                                 RXB0D56_bit         _BIT_ACCESS(RXB0D5,6)
// RXB0D5<RXB0D57>
extern volatile __bit                   RXB0D57             __at(0x7B5F);	// @ (0xF6B * 8 + 7)
#define                                 RXB0D57_bit         _BIT_ACCESS(RXB0D5,7)
// RXB0D6<RXB0D60>
extern volatile __bit                   RXB0D60             __at(0x7B60);	// @ (0xF6C * 8 + 0)
#define                                 RXB0D60_bit         _BIT_ACCESS(RXB0D6,0)
// RXB0D6<RXB0D61>
extern volatile __bit                   RXB0D61             __at(0x7B61);	// @ (0xF6C * 8 + 1)
#define                                 RXB0D61_bit         _BIT_ACCESS(RXB0D6,1)
// RXB0D6<RXB0D62>
extern volatile __bit                   RXB0D62             __at(0x7B62);	// @ (0xF6C * 8 + 2)
#define                                 RXB0D62_bit         _BIT_ACCESS(RXB0D6,2)
// RXB0D6<RXB0D63>
extern volatile __bit                   RXB0D63             __at(0x7B63);	// @ (0xF6C * 8 + 3)
#define                                 RXB0D63_bit         _BIT_ACCESS(RXB0D6,3)
// RXB0D6<RXB0D64>
extern volatile __bit                   RXB0D64             __at(0x7B64);	// @ (0xF6C * 8 + 4)
#define                                 RXB0D64_bit         _BIT_ACCESS(RXB0D6,4)
// RXB0D6<RXB0D65>
extern volatile __bit                   RXB0D65             __at(0x7B65);	// @ (0xF6C * 8 + 5)
#define                                 RXB0D65_bit         _BIT_ACCESS(RXB0D6,5)
// RXB0D6<RXB0D66>
extern volatile __bit                   RXB0D66             __at(0x7B66);	// @ (0xF6C * 8 + 6)
#define                                 RXB0D66_bit         _BIT_ACCESS(RXB0D6,6)
// RXB0D6<RXB0D67>
extern volatile __bit                   RXB0D67             __at(0x7B67);	// @ (0xF6C * 8 + 7)
#define                                 RXB0D67_bit         _BIT_ACCESS(RXB0D6,7)
// RXB0D7<RXB0D70>
extern volatile __bit                   RXB0D70             __at(0x7B68);	// @ (0xF6D * 8 + 0)
#define                                 RXB0D70_bit         _BIT_ACCESS(RXB0D7,0)
// RXB0D7<RXB0D71>
extern volatile __bit                   RXB0D71             __at(0x7B69);	// @ (0xF6D * 8 + 1)
#define                                 RXB0D71_bit         _BIT_ACCESS(RXB0D7,1)
// RXB0D7<RXB0D72>
extern volatile __bit                   RXB0D72             __at(0x7B6A);	// @ (0xF6D * 8 + 2)
#define                                 RXB0D72_bit         _BIT_ACCESS(RXB0D7,2)
// RXB0D7<RXB0D73>
extern volatile __bit                   RXB0D73             __at(0x7B6B);	// @ (0xF6D * 8 + 3)
#define                                 RXB0D73_bit         _BIT_ACCESS(RXB0D7,3)
// RXB0D7<RXB0D74>
extern volatile __bit                   RXB0D74             __at(0x7B6C);	// @ (0xF6D * 8 + 4)
#define                                 RXB0D74_bit         _BIT_ACCESS(RXB0D7,4)
// RXB0D7<RXB0D75>
extern volatile __bit                   RXB0D75             __at(0x7B6D);	// @ (0xF6D * 8 + 5)
#define                                 RXB0D75_bit         _BIT_ACCESS(RXB0D7,5)
// RXB0D7<RXB0D76>
extern volatile __bit                   RXB0D76             __at(0x7B6E);	// @ (0xF6D * 8 + 6)
#define                                 RXB0D76_bit         _BIT_ACCESS(RXB0D7,6)
// RXB0D7<RXB0D77>
extern volatile __bit                   RXB0D77             __at(0x7B6F);	// @ (0xF6D * 8 + 7)
#define                                 RXB0D77_bit         _BIT_ACCESS(RXB0D7,7)
// RXB0CON<RXB0DBEN>
extern volatile __bit                   RXB0DBEN            __at(0x7B02);	// @ (0xF60 * 8 + 2)
#define                                 RXB0DBEN_bit        _BIT_ACCESS(RXB0CON,2)
// RXB0CON<RXB0DBEN_FILHIT2>
extern volatile __bit                   RXB0DBEN_FILHIT2    __at(0x7B02);	// @ (0xF60 * 8 + 2)
#define                                 RXB0DBEN_FILHIT2_bit _BIT_ACCESS(RXB0CON,2)
// RXB0DLC<RXB0DLC0>
extern volatile __bit                   RXB0DLC0            __at(0x7B28);	// @ (0xF65 * 8 + 0)
#define                                 RXB0DLC0_bit        _BIT_ACCESS(RXB0DLC,0)
// RXB0DLC<RXB0DLC1>
extern volatile __bit                   RXB0DLC1            __at(0x7B29);	// @ (0xF65 * 8 + 1)
#define                                 RXB0DLC1_bit        _BIT_ACCESS(RXB0DLC,1)
// RXB0DLC<RXB0DLC2>
extern volatile __bit                   RXB0DLC2            __at(0x7B2A);	// @ (0xF65 * 8 + 2)
#define                                 RXB0DLC2_bit        _BIT_ACCESS(RXB0DLC,2)
// RXB0DLC<RXB0DLC3>
extern volatile __bit                   RXB0DLC3            __at(0x7B2B);	// @ (0xF65 * 8 + 3)
#define                                 RXB0DLC3_bit        _BIT_ACCESS(RXB0DLC,3)
// RXB0EIDL<RXB0EID0>
extern volatile __bit                   RXB0EID0            __at(0x7B20);	// @ (0xF64 * 8 + 0)
#define                                 RXB0EID0_bit        _BIT_ACCESS(RXB0EIDL,0)
// RXB0EIDL<RXB0EID1>
extern volatile __bit                   RXB0EID1            __at(0x7B21);	// @ (0xF64 * 8 + 1)
#define                                 RXB0EID1_bit        _BIT_ACCESS(RXB0EIDL,1)
// RXB0EIDH<RXB0EID10>
extern volatile __bit                   RXB0EID10           __at(0x7B1A);	// @ (0xF63 * 8 + 2)
#define                                 RXB0EID10_bit       _BIT_ACCESS(RXB0EIDH,2)
// RXB0EIDH<RXB0EID11>
extern volatile __bit                   RXB0EID11           __at(0x7B1B);	// @ (0xF63 * 8 + 3)
#define                                 RXB0EID11_bit       _BIT_ACCESS(RXB0EIDH,3)
// RXB0EIDH<RXB0EID12>
extern volatile __bit                   RXB0EID12           __at(0x7B1C);	// @ (0xF63 * 8 + 4)
#define                                 RXB0EID12_bit       _BIT_ACCESS(RXB0EIDH,4)
// RXB0EIDH<RXB0EID13>
extern volatile __bit                   RXB0EID13           __at(0x7B1D);	// @ (0xF63 * 8 + 5)
#define                                 RXB0EID13_bit       _BIT_ACCESS(RXB0EIDH,5)
// RXB0EIDH<RXB0EID14>
extern volatile __bit                   RXB0EID14           __at(0x7B1E);	// @ (0xF63 * 8 + 6)
#define                                 RXB0EID14_bit       _BIT_ACCESS(RXB0EIDH,6)
// RXB0EIDH<RXB0EID15>
extern volatile __bit                   RXB0EID15           __at(0x7B1F);	// @ (0xF63 * 8 + 7)
#define                                 RXB0EID15_bit       _BIT_ACCESS(RXB0EIDH,7)
// RXB0SIDL<RXB0EID16>
extern volatile __bit                   RXB0EID16           __at(0x7B10);	// @ (0xF62 * 8 + 0)
#define                                 RXB0EID16_bit       _BIT_ACCESS(RXB0SIDL,0)
// RXB0SIDL<RXB0EID17>
extern volatile __bit                   RXB0EID17           __at(0x7B11);	// @ (0xF62 * 8 + 1)
#define                                 RXB0EID17_bit       _BIT_ACCESS(RXB0SIDL,1)
// RXB0EIDL<RXB0EID2>
extern volatile __bit                   RXB0EID2            __at(0x7B22);	// @ (0xF64 * 8 + 2)
#define                                 RXB0EID2_bit        _BIT_ACCESS(RXB0EIDL,2)
// RXB0EIDL<RXB0EID3>
extern volatile __bit                   RXB0EID3            __at(0x7B23);	// @ (0xF64 * 8 + 3)
#define                                 RXB0EID3_bit        _BIT_ACCESS(RXB0EIDL,3)
// RXB0EIDL<RXB0EID4>
extern volatile __bit                   RXB0EID4            __at(0x7B24);	// @ (0xF64 * 8 + 4)
#define                                 RXB0EID4_bit        _BIT_ACCESS(RXB0EIDL,4)
// RXB0EIDL<RXB0EID5>
extern volatile __bit                   RXB0EID5            __at(0x7B25);	// @ (0xF64 * 8 + 5)
#define                                 RXB0EID5_bit        _BIT_ACCESS(RXB0EIDL,5)
// RXB0EIDL<RXB0EID6>
extern volatile __bit                   RXB0EID6            __at(0x7B26);	// @ (0xF64 * 8 + 6)
#define                                 RXB0EID6_bit        _BIT_ACCESS(RXB0EIDL,6)
// RXB0EIDL<RXB0EID7>
extern volatile __bit                   RXB0EID7            __at(0x7B27);	// @ (0xF64 * 8 + 7)
#define                                 RXB0EID7_bit        _BIT_ACCESS(RXB0EIDL,7)
// RXB0EIDH<RXB0EID8>
extern volatile __bit                   RXB0EID8            __at(0x7B18);	// @ (0xF63 * 8 + 0)
#define                                 RXB0EID8_bit        _BIT_ACCESS(RXB0EIDH,0)
// RXB0EIDH<RXB0EID9>
extern volatile __bit                   RXB0EID9            __at(0x7B19);	// @ (0xF63 * 8 + 1)
#define                                 RXB0EID9_bit        _BIT_ACCESS(RXB0EIDH,1)
// RXB0SIDL<RXB0EXID>
extern volatile __bit                   RXB0EXID            __at(0x7B13);	// @ (0xF62 * 8 + 3)
#define                                 RXB0EXID_bit        _BIT_ACCESS(RXB0SIDL,3)
// RXB0CON<RXB0FILHIT0>
extern volatile __bit                   RXB0FILHIT0         __at(0x7B00);	// @ (0xF60 * 8 + 0)
#define                                 RXB0FILHIT0_bit     _BIT_ACCESS(RXB0CON,0)
// RXB0CON<RXB0FILHIT1>
extern volatile __bit                   RXB0FILHIT1         __at(0x7B01);	// @ (0xF60 * 8 + 1)
#define                                 RXB0FILHIT1_bit     _BIT_ACCESS(RXB0CON,1)
// RXB0CON<RXB0FILHIT2>
extern volatile __bit                   RXB0FILHIT2         __at(0x7B02);	// @ (0xF60 * 8 + 2)
#define                                 RXB0FILHIT2_bit     _BIT_ACCESS(RXB0CON,2)
// RXB0CON<RXB0FILHIT3>
extern volatile __bit                   RXB0FILHIT3         __at(0x7B03);	// @ (0xF60 * 8 + 3)
#define                                 RXB0FILHIT3_bit     _BIT_ACCESS(RXB0CON,3)
// RXB0CON<RXB0FILHIT4>
extern volatile __bit                   RXB0FILHIT4         __at(0x7B04);	// @ (0xF60 * 8 + 4)
#define                                 RXB0FILHIT4_bit     _BIT_ACCESS(RXB0CON,4)
// RXB0CON<RXB0FUL>
extern volatile __bit                   RXB0FUL             __at(0x7B07);	// @ (0xF60 * 8 + 7)
#define                                 RXB0FUL_bit         _BIT_ACCESS(RXB0CON,7)
// PIE3<RXB0IE>
extern volatile __bit _DEPRECATED       RXB0IE              __at(0x7D18);	// @ (0xFA3 * 8 + 0)
#define                                 RXB0IE_bit          _BIT_ACCESS(PIE3,0)
// PIR3<RXB0IF>
extern volatile __bit                   RXB0IF              __at(0x7D20);	// @ (0xFA4 * 8 + 0)
#define                                 RXB0IF_bit          _BIT_ACCESS(PIR3,0)
// IPR3<RXB0IP>
extern volatile __bit                   RXB0IP              __at(0x7D28);	// @ (0xFA5 * 8 + 0)
#define                                 RXB0IP_bit          _BIT_ACCESS(IPR3,0)
// RXB0CON<RXB0M0>
extern volatile __bit                   RXB0M0              __at(0x7B05);	// @ (0xF60 * 8 + 5)
#define                                 RXB0M0_bit          _BIT_ACCESS(RXB0CON,5)
// RXB0CON<RXB0M1>
extern volatile __bit                   RXB0M1              __at(0x7B06);	// @ (0xF60 * 8 + 6)
#define                                 RXB0M1_bit          _BIT_ACCESS(RXB0CON,6)
// COMSTAT<RXB0OVFL>
extern volatile __bit                   RXB0OVFL            __at(0x7BA7);	// @ (0xF74 * 8 + 7)
#define                                 RXB0OVFL_bit        _BIT_ACCESS(COMSTAT,7)
// COMSTAT<RXB0OVFL_NOT_FIFOEMPTY>
extern volatile __bit                   RXB0OVFL_NOT_FIFOEMPTY __at(0x7BA7);	// @ (0xF74 * 8 + 7)
#define                                 RXB0OVFL_NOT_FIFOEMPTY_bit _BIT_ACCESS(COMSTAT,7)
// COMSTAT<RXB0OVFL_nFIFOEMPTY>
extern volatile __bit                   RXB0OVFL_nFIFOEMPTY __at(0x7BA7);	// @ (0xF74 * 8 + 7)
#define                                 RXB0OVFL_nFIFOEMPTY_bit _BIT_ACCESS(COMSTAT,7)
// RXB0DLC<RXB0RB0>
extern volatile __bit                   RXB0RB0             __at(0x7B2C);	// @ (0xF65 * 8 + 4)
#define                                 RXB0RB0_bit         _BIT_ACCESS(RXB0DLC,4)
// RXB0DLC<RXB0RB1>
extern volatile __bit                   RXB0RB1             __at(0x7B2D);	// @ (0xF65 * 8 + 5)
#define                                 RXB0RB1_bit         _BIT_ACCESS(RXB0DLC,5)
// RXB0DLC<RXB0RTR>
extern volatile __bit                   RXB0RTR             __at(0x7B2E);	// @ (0xF65 * 8 + 6)
#define                                 RXB0RTR_bit         _BIT_ACCESS(RXB0DLC,6)
// RXB0CON<RXB0RTRR0>
extern volatile __bit                   RXB0RTRR0           __at(0x7B03);	// @ (0xF60 * 8 + 3)
#define                                 RXB0RTRR0_bit       _BIT_ACCESS(RXB0CON,3)
// RXB0CON<RXB0RTRRO>
extern volatile __bit                   RXB0RTRRO           __at(0x7B05);	// @ (0xF60 * 8 + 5)
#define                                 RXB0RTRRO_bit       _BIT_ACCESS(RXB0CON,5)
// RXB0SIDL<RXB0SID0>
extern volatile __bit                   RXB0SID0            __at(0x7B15);	// @ (0xF62 * 8 + 5)
#define                                 RXB0SID0_bit        _BIT_ACCESS(RXB0SIDL,5)
// RXB0SIDL<RXB0SID1>
extern volatile __bit                   RXB0SID1            __at(0x7B16);	// @ (0xF62 * 8 + 6)
#define                                 RXB0SID1_bit        _BIT_ACCESS(RXB0SIDL,6)
// RXB0SIDH<RXB0SID10>
extern volatile __bit                   RXB0SID10           __at(0x7B0F);	// @ (0xF61 * 8 + 7)
#define                                 RXB0SID10_bit       _BIT_ACCESS(RXB0SIDH,7)
// RXB0SIDL<RXB0SID2>
extern volatile __bit                   RXB0SID2            __at(0x7B17);	// @ (0xF62 * 8 + 7)
#define                                 RXB0SID2_bit        _BIT_ACCESS(RXB0SIDL,7)
// RXB0SIDH<RXB0SID3>
extern volatile __bit                   RXB0SID3            __at(0x7B08);	// @ (0xF61 * 8 + 0)
#define                                 RXB0SID3_bit        _BIT_ACCESS(RXB0SIDH,0)
// RXB0SIDH<RXB0SID4>
extern volatile __bit                   RXB0SID4            __at(0x7B09);	// @ (0xF61 * 8 + 1)
#define                                 RXB0SID4_bit        _BIT_ACCESS(RXB0SIDH,1)
// RXB0SIDH<RXB0SID5>
extern volatile __bit                   RXB0SID5            __at(0x7B0A);	// @ (0xF61 * 8 + 2)
#define                                 RXB0SID5_bit        _BIT_ACCESS(RXB0SIDH,2)
// RXB0SIDH<RXB0SID6>
extern volatile __bit                   RXB0SID6            __at(0x7B0B);	// @ (0xF61 * 8 + 3)
#define                                 RXB0SID6_bit        _BIT_ACCESS(RXB0SIDH,3)
// RXB0SIDH<RXB0SID7>
extern volatile __bit                   RXB0SID7            __at(0x7B0C);	// @ (0xF61 * 8 + 4)
#define                                 RXB0SID7_bit        _BIT_ACCESS(RXB0SIDH,4)
// RXB0SIDH<RXB0SID8>
extern volatile __bit                   RXB0SID8            __at(0x7B0D);	// @ (0xF61 * 8 + 5)
#define                                 RXB0SID8_bit        _BIT_ACCESS(RXB0SIDH,5)
// RXB0SIDH<RXB0SID9>
extern volatile __bit                   RXB0SID9            __at(0x7B0E);	// @ (0xF61 * 8 + 6)
#define                                 RXB0SID9_bit        _BIT_ACCESS(RXB0SIDH,6)
// RXB0SIDL<RXB0SRR>
extern volatile __bit                   RXB0SRR             __at(0x7B14);	// @ (0xF62 * 8 + 4)
#define                                 RXB0SRR_bit         _BIT_ACCESS(RXB0SIDL,4)
// RXB1D0<RXB1D00>
extern volatile __bit                   RXB1D00             __at(0x7AB0);	// @ (0xF56 * 8 + 0)
#define                                 RXB1D00_bit         _BIT_ACCESS(RXB1D0,0)
// RXB1D0<RXB1D01>
extern volatile __bit                   RXB1D01             __at(0x7AB1);	// @ (0xF56 * 8 + 1)
#define                                 RXB1D01_bit         _BIT_ACCESS(RXB1D0,1)
// RXB1D0<RXB1D02>
extern volatile __bit                   RXB1D02             __at(0x7AB2);	// @ (0xF56 * 8 + 2)
#define                                 RXB1D02_bit         _BIT_ACCESS(RXB1D0,2)
// RXB1D0<RXB1D03>
extern volatile __bit                   RXB1D03             __at(0x7AB3);	// @ (0xF56 * 8 + 3)
#define                                 RXB1D03_bit         _BIT_ACCESS(RXB1D0,3)
// RXB1D0<RXB1D04>
extern volatile __bit                   RXB1D04             __at(0x7AB4);	// @ (0xF56 * 8 + 4)
#define                                 RXB1D04_bit         _BIT_ACCESS(RXB1D0,4)
// RXB1D0<RXB1D05>
extern volatile __bit                   RXB1D05             __at(0x7AB5);	// @ (0xF56 * 8 + 5)
#define                                 RXB1D05_bit         _BIT_ACCESS(RXB1D0,5)
// RXB1D0<RXB1D06>
extern volatile __bit                   RXB1D06             __at(0x7AB6);	// @ (0xF56 * 8 + 6)
#define                                 RXB1D06_bit         _BIT_ACCESS(RXB1D0,6)
// RXB1D0<RXB1D07>
extern volatile __bit                   RXB1D07             __at(0x7AB7);	// @ (0xF56 * 8 + 7)
#define                                 RXB1D07_bit         _BIT_ACCESS(RXB1D0,7)
// RXB1D1<RXB1D10>
extern volatile __bit                   RXB1D10             __at(0x7AB8);	// @ (0xF57 * 8 + 0)
#define                                 RXB1D10_bit         _BIT_ACCESS(RXB1D1,0)
// RXB1D1<RXB1D11>
extern volatile __bit                   RXB1D11             __at(0x7AB9);	// @ (0xF57 * 8 + 1)
#define                                 RXB1D11_bit         _BIT_ACCESS(RXB1D1,1)
// RXB1D1<RXB1D12>
extern volatile __bit                   RXB1D12             __at(0x7ABA);	// @ (0xF57 * 8 + 2)
#define                                 RXB1D12_bit         _BIT_ACCESS(RXB1D1,2)
// RXB1D1<RXB1D13>
extern volatile __bit                   RXB1D13             __at(0x7ABB);	// @ (0xF57 * 8 + 3)
#define                                 RXB1D13_bit         _BIT_ACCESS(RXB1D1,3)
// RXB1D1<RXB1D14>
extern volatile __bit                   RXB1D14             __at(0x7ABC);	// @ (0xF57 * 8 + 4)
#define                                 RXB1D14_bit         _BIT_ACCESS(RXB1D1,4)
// RXB1D1<RXB1D15>
extern volatile __bit                   RXB1D15             __at(0x7ABD);	// @ (0xF57 * 8 + 5)
#define                                 RXB1D15_bit         _BIT_ACCESS(RXB1D1,5)
// RXB1D1<RXB1D16>
extern volatile __bit                   RXB1D16             __at(0x7ABE);	// @ (0xF57 * 8 + 6)
#define                                 RXB1D16_bit         _BIT_ACCESS(RXB1D1,6)
// RXB1D1<RXB1D17>
extern volatile __bit                   RXB1D17             __at(0x7ABF);	// @ (0xF57 * 8 + 7)
#define                                 RXB1D17_bit         _BIT_ACCESS(RXB1D1,7)
// RXB1D2<RXB1D20>
extern volatile __bit                   RXB1D20             __at(0x7AC0);	// @ (0xF58 * 8 + 0)
#define                                 RXB1D20_bit         _BIT_ACCESS(RXB1D2,0)
// RXB1D2<RXB1D21>
extern volatile __bit                   RXB1D21             __at(0x7AC1);	// @ (0xF58 * 8 + 1)
#define                                 RXB1D21_bit         _BIT_ACCESS(RXB1D2,1)
// RXB1D2<RXB1D22>
extern volatile __bit                   RXB1D22             __at(0x7AC2);	// @ (0xF58 * 8 + 2)
#define                                 RXB1D22_bit         _BIT_ACCESS(RXB1D2,2)
// RXB1D2<RXB1D23>
extern volatile __bit                   RXB1D23             __at(0x7AC3);	// @ (0xF58 * 8 + 3)
#define                                 RXB1D23_bit         _BIT_ACCESS(RXB1D2,3)
// RXB1D2<RXB1D24>
extern volatile __bit                   RXB1D24             __at(0x7AC4);	// @ (0xF58 * 8 + 4)
#define                                 RXB1D24_bit         _BIT_ACCESS(RXB1D2,4)
// RXB1D2<RXB1D25>
extern volatile __bit                   RXB1D25             __at(0x7AC5);	// @ (0xF58 * 8 + 5)
#define                                 RXB1D25_bit         _BIT_ACCESS(RXB1D2,5)
// RXB1D2<RXB1D26>
extern volatile __bit                   RXB1D26             __at(0x7AC6);	// @ (0xF58 * 8 + 6)
#define                                 RXB1D26_bit         _BIT_ACCESS(RXB1D2,6)
// RXB1D2<RXB1D27>
extern volatile __bit                   RXB1D27             __at(0x7AC7);	// @ (0xF58 * 8 + 7)
#define                                 RXB1D27_bit         _BIT_ACCESS(RXB1D2,7)
// RXB1D3<RXB1D30>
extern volatile __bit                   RXB1D30             __at(0x7AC8);	// @ (0xF59 * 8 + 0)
#define                                 RXB1D30_bit         _BIT_ACCESS(RXB1D3,0)
// RXB1D3<RXB1D31>
extern volatile __bit                   RXB1D31             __at(0x7AC9);	// @ (0xF59 * 8 + 1)
#define                                 RXB1D31_bit         _BIT_ACCESS(RXB1D3,1)
// RXB1D3<RXB1D32>
extern volatile __bit                   RXB1D32             __at(0x7ACA);	// @ (0xF59 * 8 + 2)
#define                                 RXB1D32_bit         _BIT_ACCESS(RXB1D3,2)
// RXB1D3<RXB1D33>
extern volatile __bit                   RXB1D33             __at(0x7ACB);	// @ (0xF59 * 8 + 3)
#define                                 RXB1D33_bit         _BIT_ACCESS(RXB1D3,3)
